fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Свернуть выплаты по сотрудникам, чтобы получить одну запись на сотрудника
	ЗарплатнаяВедомость = Выплаты.Выгрузить();
	ЗарплатнаяВедомость.Свернуть("Сотрудник", "Сумма");
	
	// Заблокировать регистр взаиморасчетов по сотрудникам документа,
	// чтобы исключить одновременную переплату из другого сеанса
	Если НЕ ЗаблокироватьРегистрВзаиморасчетов(ЗарплатнаяВедомость, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	// Регистр ВКМ_ВзаиморасчетыССотрудниками — расход
	// (выплата уменьшает долг предприятия перед сотрудником)
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВыплаты Из ЗарплатнаяВедомость Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
		Движение.Сумма = ТекСтрокаВыплаты.Сумма;
	КонецЦикла;
	
	// Проверить превышение выплат над начислениями — уже под блокировкой
	ПроверитьПревышениеВыплатНадНачислениями(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмеютсяПроведенныеДокументыСозданныеПослеТекущего() Тогда
		ТекстСообщения = "Нарушается последовательность проведения документов.
			|Имеются более поздние проведенные документы ВыплатаЗарплаты.
			|Для записи этого документа отмените проведения всех последующих 
			|и повторите попытку записи.";
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Блокирует регистр взаиморасчетов по всем сотрудникам, указанным
// в табличной части Выплаты. Вызывается перед формированием движений,
// чтобы исключить параллельную переплату из другого сеанса.
//
// Параметры:
//   ЗарплатнаяВедомость - ТаблицаЗначений - свернутая по сотрудникам ТЧ.
//   Отказ - Булево - (входной/выходной) признак отказа проведения.
//
// Возвращаемое значение:
//   Булево - Истина, если блокировка установлена.
//
Функция ЗаблокироватьРегистрВзаиморасчетов(ЗарплатнаяВедомость, Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить(
		"РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Для Каждого СтрокаВедомости Из ЗарплатнаяВедомость Цикл
		ЭлементБлокировки.УстановитьЗначение(
			"Сотрудник", СтрокаВедомости.Сотрудник);
	КонецЦикла;
	
	Попытка
		Блокировка.Заблокировать();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(
			ИнформацияОбОшибке());
		ОбщегоНазначения.СообщитьПользователю(
			"Не удалось заблокировать данные для расчета. Документ не проведён.
			|Подробности: " + ТекстОшибки, , , , Отказ);
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

// Проверяет, что сумма выплаты по каждому сотруднику не превышает
// сумму начислений. При превышении устанавливает Отказ и сообщает
// пользователю сумму переплаты.
//
// Параметры:
//   Отказ - Булево - (входной/выходной) признак отказа проведения.
//
Процедура ПроверитьПревышениеВыплатНадНачислениями(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Остатки.Сотрудник) КАК Сотрудник,
		|	Остатки.СуммаОстаток КАК Переплата
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(
		|			&Граница,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					Выплаты.Сотрудник КАК Сотрудник
		|				ИЗ
		|					Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК Выплаты
		|				ГДЕ
		|					Выплаты.Ссылка = &Ссылка)) КАК Остатки
		|ГДЕ
		|	Остатки.СуммаОстаток < 0";
	
	Запрос.УстановитьПараметр("Граница", 
		Новый Граница(МоментВремени(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = СтрШаблон(
			"Операция невозможна. По сотруднику %1 сумма к выдаче превышает 
			|сумму начисления на %2 руб.",
			Выборка.Сотрудник, -Выборка.Переплата);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

// Проверяет, есть ли проведенные документы ВыплатаЗарплаты
// с датой больше или равной дате текущего документа.
//
// Возвращаемое значение:
//   Булево - Истина, если найдены более поздние проведенные документы.
//
Функция ИмеютсяПроведенныеДокументыСозданныеПослеТекущего()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВКМ_ВыплатаЗарплаты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВКМ_ВыплатаЗарплаты КАК ВКМ_ВыплатаЗарплаты
		|ГДЕ
		|	ВКМ_ВыплатаЗарплаты.Дата >= &ДатаДокумента
		|	И ВКМ_ВыплатаЗарплаты.Ссылка <> &Ссылка
		|	И ВКМ_ВыплатаЗарплаты.Проведен = ИСТИНА";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
